In [ ]:
# üåü What is Pandas?
# Seetha: "Rama, enti ee Pandas antey? Animals aa?"

# Rama: "No no Seetha! üêº kaadhu. Idi Python lo oka library. Excel laga data ni easy ga read, write, modify cheyyadam ki use chestam!"

In [ ]:
# üéí Why is Pandas Used?
# Seetha PhD research ki data collect chesindi. CSV lo undi. Aa file ni read cheyyali, analysis cheyyali, graphs cheyyali ‚Äî anni cheyyadaaniki Pandas avasaram.

In [ ]:
# üîë Key Pandas Concepts:
# Concept	Simple Explanation	Story Example
# Series	Single column data	Seetha's marks in English only
# DataFrame	Table of rows & columns	Seetha's full report card
# read_csv()	File open cheyyadam	Seetha opens her attendance sheet
# head()	Top 5 rows chupistundi	Rama chustunnadu first 5 student names
# tail()	Last 5 rows chupistundi	Seetha chustundi last 5 exam scores
# info()	Overview of data	Rama asks: "Enta data undi? Null values unnaya?"
# describe()	Summary statistics	Average, max, min scores Seetha chudali ante idi use

In [ ]:
# üêç Code Examples With Story:

In [1]:
# 1. Read CSV
import pandas as pd
df=pd.read_csv(r"C:\Users\91944\Desktop\Foundations of Data Science\student-data.csv")
print(df)

    school sex  age address famsize Pstatus  Medu  Fedu      Mjob      Fjob  \
0       GP   F   18       U     GT3       A     4     4   at_home   teacher
1       GP   F   17       U     GT3       T     1     1   at_home     other
2       GP   F   15       U     LE3       T     1     1   at_home     other
3       GP   F   15       U     GT3       T     4     2    health  services
4       GP   F   16       U     GT3       T     3     3     other     other
..     ...  ..  ...     ...     ...     ...   ...   ...       ...       ...
390     MS   M   20       U     LE3       A     2     2  services  services
391     MS   M   17       U     LE3       T     3     1  services  services
392     MS   M   21       R     GT3       T     1     1     other     other
393     MS   M   18       R     LE3       T     3     2  services     other
394     MS   M   19       U     LE3       T     1     1     other   at_home

     ... internet romantic  famrel  freetime  goout Dalc Walc health absences  \
0    ...       no       no       4         3      4    1    1      3        6
1    ...      yes       no       5         3      3    1    1      3        4
2    ...      yes       no       4         3      2    2    3      3       10
3    ...      yes      yes       3         2      2    1    1      5        2
4    ...       no       no       4         3      2    1    2      5        4
..   ...      ...      ...     ...       ...    ...  ...  ...    ...      ...
390  ...       no       no       5         5      4    4    5      4       11
391  ...      yes       no       2         4      5    3    4      2        3
392  ...       no       no       5         5      3    3    3      3        3
393  ...      yes       no       4         4      1    3    4      5        0
394  ...      yes       no       3         2      3    3    3      5        5

    passed
0       no
1       no
2      yes
3      yes
4      yes
..     ...
390     no
391    yes
392     no
393    yes
394     no

[395 rows x 31 columns]

In [3]:
print(df.head())      #Seetha attendance file ni open chesi Rama ki chupistundi ‚Äî ‚ÄúChudu Rama, na 5 days attendance.

  school sex  age address famsize Pstatus  Medu  Fedu     Mjob      Fjob  ...  \
0     GP   F   18       U     GT3       A     4     4  at_home   teacher  ...
1     GP   F   17       U     GT3       T     1     1  at_home     other  ...
2     GP   F   15       U     LE3       T     1     1  at_home     other  ...
3     GP   F   15       U     GT3       T     4     2   health  services  ...
4     GP   F   16       U     GT3       T     3     3    other     other  ...

  internet romantic  famrel  freetime  goout Dalc Walc health absences passed
0       no       no       4         3      4    1    1      3        6     no
1      yes       no       5         3      3    1    1      3        4     no
2      yes       no       4         3      2    2    3      3       10    yes
3      yes      yes       3         2      2    1    1      5        2    yes
4       no       no       4         3      2    1    2      5        4    yes

[5 rows x 31 columns]

In [5]:
# 2. Check Structure
df.info() #Rama thinks: ‚ÄúHmm.. null values unna? Enta data undi?

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 395 entries, 0 to 394
Data columns (total 31 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   school      395 non-null    object
 1   sex         395 non-null    object
 2   age         395 non-null    int64
 3   address     395 non-null    object
 4   famsize     395 non-null    object
 5   Pstatus     395 non-null    object
 6   Medu        395 non-null    int64
 7   Fedu        395 non-null    int64
 8   Mjob        395 non-null    object
 9   Fjob        395 non-null    object
 10  reason      395 non-null    object
 11  guardian    395 non-null    object
 12  traveltime  395 non-null    int64
 13  studytime   395 non-null    int64
 14  failures    395 non-null    int64
 15  schoolsup   395 non-null    object
 16  famsup      395 non-null    object
 17  paid        395 non-null    object
 18  activities  395 non-null    object
 19  nursery     395 non-null    object
 20  higher      395 non-null    object
 21  internet    395 non-null    object
 22  romantic    395 non-null    object
 23  famrel      395 non-null    int64
 24  freetime    395 non-null    int64
 25  goout       395 non-null    int64
 26  Dalc        395 non-null    int64
 27  Walc        395 non-null    int64
 28  health      395 non-null    int64
 29  absences    395 non-null    int64
 30  passed      395 non-null    object
dtypes: int64(13), object(18)
memory usage: 95.8+ KB

In [9]:
# 3. Describe Data
df.describe()  #Seetha: ‚ÄúRama, na average marks, min, max enti chudu!‚Äù

,age,Medu,Fedu,traveltime,studytime,failures,famrel,freetime,goout,Dalc,Walc,health,absences
count,395.000000,395.000000,395.000000,395.000000,395.000000,395.000000,395.000000,395.000000,395.000000,395.000000,395.000000,395.000000,395.000000
mean,16.696203,2.749367,2.521519,1.448101,2.035443,0.334177,3.944304,3.235443,3.108861,1.481013,2.291139,3.554430,5.708861
std,1.276043,1.094735,1.088201,0.697505,0.839240,0.743651,0.896659,0.998862,1.113278,0.890741,1.287897,1.390303,8.003096
min,15.000000,0.000000,0.000000,1.000000,1.000000,0.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,0.000000
25%,16.000000,2.000000,2.000000,1.000000,1.000000,0.000000,4.000000,3.000000,2.000000,1.000000,1.000000,3.000000,0.000000
50%,17.000000,3.000000,2.000000,1.000000,2.000000,0.000000,4.000000,3.000000,3.000000,1.000000,2.000000,4.000000,4.000000
75%,18.000000,4.000000,3.000000,2.000000,2.000000,0.000000,5.000000,4.000000,4.000000,2.000000,3.000000,5.000000,8.000000
max,22.000000,4.000000,4.000000,4.000000,4.000000,3.000000,5.000000,5.000000,5.000000,5.000000,5.000000,5.000000,75.000000

In [13]:
# 4. Accessing Specific Data(specific col accessing)
df['age']

0      18
1      17
2      15
3      15
4      16
       ..
390    20
391    17
392    21
393    18
394    19
Name: age, Length: 395, dtype: int64

In [17]:
df['freetime']

0      3
1      3
2      3
3      2
4      3
      ..
390    5
391    4
392    5
393    4
394    2
Name: freetime, Length: 395, dtype: int64

In [21]:
#TO acess multiple columns
df[['age','health']]     #üîç Seetha: ‚ÄúNa age and na health matrame chupinchali Rama!‚Äù

     age  health
0     18       3
1     17       3
2     15       3
3     15       5
4     16       5
..   ...     ...
390   20       4
391   17       2
392   21       3
393   18       5
394   19       5

[395 rows x 2 columns]

In [35]:
#Pandas lo manam sql lo laaga filtering kuda cheyavachu
#5. Filtering (Like WHERE in SQL)
df[df['age']>10]

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,...,internet,romantic,famrel,freetime,goout,Dalc,Walc,health,absences,passed
0,GP,F,18,U,GT3,A,4,4,at_home,teacher,...,no,no,4,3,4,1,1,3,6,no
1,GP,F,17,U,GT3,T,1,1,at_home,other,...,yes,no,5,3,3,1,1,3,4,no
2,GP,F,15,U,LE3,T,1,1,at_home,other,...,yes,no,4,3,2,2,3,3,10,yes
3,GP,F,15,U,GT3,T,4,2,health,services,...,yes,yes,3,2,2,1,1,5,2,yes
4,GP,F,16,U,GT3,T,3,3,other,other,...,no,no,4,3,2,1,2,5,4,yes
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
390,MS,M,20,U,LE3,A,2,2,services,services,...,no,no,5,5,4,4,5,4,11,no
391,MS,M,17,U,LE3,T,3,1,services,services,...,yes,no,2,4,5,3,4,2,3,yes
392,MS,M,21,R,GT3,T,1,1,other,other,...,no,no,5,5,3,3,3,3,3,no
393,MS,M,18,R,LE3,T,3,2,services,other,...,yes,no,4,4,1,3,4,5,0,yes
394,MS,M,19,U,LE3,T,1,1,other,at_home,...,yes,no,3,2,3,3,3,5,5,no

In [ ]:
# ü™Ñ Pandas lo Sorting
# üßï Scene:
# Seetha teacher ga class lo students list ni arrange cheyali ‚Äì
# üîπ oka sari Marks wise
# üîπ inko sari Name wise
# üîπ sometimes reverse order lo too.

# Aa paniki Pandas lo sort_values() use chestam.
#Syntax
#df.sort_values(by='ColumnName', ascending=True/False)

In [41]:
import pandas as pd

data = {
    'name': ['Rama', 'Seetha', 'Hanuman', 'Lakshmana'],
    'marks': [95, 98, 89, 91]
}

df = pd.DataFrame(data)
print(df)

        name  marks
0       Rama     95
1     Seetha     98
2    Hanuman     89
3  Lakshmana     91

In [43]:
# üåü 1. Sort by Marks (Ascending - Small to Big)
df.sort_values(by='marks')

        name  marks
2    Hanuman     89
3  Lakshmana     91
0       Rama     95
1     Seetha     98

In [45]:
df.sort_values(by='name')

        name  marks
2    Hanuman     89
3  Lakshmana     91
0       Rama     95
1     Seetha     98

In [47]:
# üåü 2. Sort by Marks (Descending - Topper First)
df.sort_values(by='marks', ascending=False)

        name  marks
1     Seetha     98
0       Rama     95
3  Lakshmana     91
2    Hanuman     89

In [5]:
#Exercises homework
import pandas as pd

data = {
    'name': ['Seetha', 'Rama', 'Lakshmana', 'Hanuman', 'Bharata'],
    'age': [24, 25, 22, 26, 23],
    'marks': [98, 95, 91, 89, 92]
}

df = pd.DataFrame(data)

In [7]:
# üî∏Q1: Show the full DataFrame.
print(df)

        name  age  marks
0     Seetha   24     98
1       Rama   25     95
2  Lakshmana   22     91
3    Hanuman   26     89
4    Bharata   23     92

In [9]:
# üî∏Q2: Show only the name column.
# (Single column access)
print(df['name'])

0       Seetha
1         Rama
2    Lakshmana
3      Hanuman
4      Bharata
Name: name, dtype: object

In [11]:
# üî∏Q3: Show the names and marks of students who scored more than 90.
#üß© Step 1: Filter who scored more than 90
df['marks'] > 90

0     True
1     True
2     True
3    False
4     True
Name: marks, dtype: bool

In [17]:
# üß© Step 2: Filter that data
df[df['marks']>90]
#Idi only those rows ni istundi where marks > 90

        name  age  marks
0     Seetha   24     98
1       Rama   25     95
2  Lakshmana   22     91
4    Bharata   23     92

In [19]:
# üß© Step 3: Only show name and marks columns
df[df['marks']>90][['name','marks']]

        name  marks
0     Seetha     98
1       Rama     95
2  Lakshmana     91
4    Bharata     92

In [23]:
#lets create a Simple Table (Data Frame)
data={
'name':['seetha','Diya','Ravi'],
    'age':[23,45,66],
    'marks':[98,91,89]
    
}
df=pd.DataFrame(data)
print(df)

     name  age  marks
0  seetha   23     98
1    Diya   45     91
2    Ravi   66     89

In [25]:
df['age']

0    23
1    45
2    66
Name: age, dtype: int64

In [27]:
df['marks']

0    98
1    91
2    89
Name: marks, dtype: int64

In [29]:
df['name']

0    seetha
1      Diya
2      Ravi
Name: name, dtype: object

In [33]:
df.loc[2]

name     Ravi
age        66
marks      89
Name: 2, dtype: object

In [35]:
df.loc[1]

name     Diya
age        45
marks      91
Name: 1, dtype: object

In [39]:
df.loc[0]

name     seetha
age          23
marks        98
Name: 0, dtype: object

In [41]:
df['marks']

0    98
1    91
2    89
Name: marks, dtype: int64

In [43]:
df[df['marks']>90]

     name  age  marks
0  seetha   23     98
1    Diya   45     91

In [45]:
df.sort_values('marks')

     name  age  marks
2    Ravi   66     89
1    Diya   45     91
0  seetha   23     98

In [53]:
df.sort_values('name')[['name','marks']]

     name  marks
1    Diya     91
2    Ravi     89
0  seetha     98

In [57]:
import pandas as pd

data = {
    'name': ['Seetha', 'Diya', 'Ravi', 'Akhil', 'Bhavya'],
    'age': [24, 22, 23, 21, 25],
    'marks': [98, 91, 89, 95, 88],
    'city': ['Tirupati', 'Chennai', 'Madanapalle', 'Hyderabad', 'Bangalore']
}

df = pd.DataFrame(data)

In [ ]:
# üìö Questions:
# üî∏ Q1: Show only the names of students who are younger than 24.
# üî∏ Q2: Display the names and marks of students who scored less than 90.
# üî∏ Q3: Add a new column called 'status' where:
# If marks >= 90 ‚Üí status is 'Pass'

# Else ‚Üí status is 'Fail'

# (Use: df['status'] = ... and a condition)

# üî∏ Q4: Sort the table by 'marks' in descending order.
# üî∏ Q5: Show only 'name', 'city', and 'status' columns for all students.

In [69]:
# Q1: Show only the names of students who are younger than 24.
df[df['age']<24]['name']

1     Diya
2     Ravi
3    Akhil
Name: name, dtype: object

In [77]:
# üî∏ Q2: Display the names and marks of students who scored less than 90.
df[df['marks']<90][['name','marks']]

     name  marks
2    Ravi     89
4  Bhavya     88

In [81]:
# üî∏ Q3: Add a new column called 'status' where:

In [89]:
 # Q4: Sort the table by 'marks' in descending order.
df.sort_values('marks',ascending=False)

     name  age  marks         city
0  Seetha   24     98     Tirupati
3   Akhil   21     95    Hyderabad
1    Diya   22     91      Chennai
2    Ravi   23     89  Madanapalle
4  Bhavya   25     88    Bangalore

In [91]:
# Sort and update original table (permanently):
df.sort_values('marks',ascending=False, inplace=True)

In [93]:
df

     name  age  marks         city
0  Seetha   24     98     Tirupati
3   Akhil   21     95    Hyderabad
1    Diya   22     91      Chennai
2    Ravi   23     89  Madanapalle
4  Bhavya   25     88    Bangalore

In [97]:
# Q5: Show only name, city columns üí™
df[['name','city']]

     name         city
0  Seetha     Tirupati
3   Akhil    Hyderabad
1    Diya      Chennai
2    Ravi  Madanapalle
4  Bhavya    Bangalore